app/models/user.rb

  def self.find_by_credentials(credential, password)
    # determine the field you need to query:
    #   * `email` if `credential` matches `URI::MailTo::EMAIL_REGEXP`
    #   * `username` if not
    # find the user whose email/username is equal to `credential`
    if credential.match(URI::MailTo::EMAIL_REGEXP)
      user = User.find_by(email: credential)
    else
      user = User.find_by(username: credential)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "username"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = generate_unique_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-01-02 22:46:14.501827"], ["id", 1]]

  def generate_unique_session_token
    token = SecureRandom::urlsafe_base64(16)
    while User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]